---
kind: type
id: T:Autodesk.Revit.DB.Structure.FabricLapSplicePosition
source: html/071195a4-2cf6-2ba8-b1d5-302f2aa52cc4.htm
---
# Autodesk.Revit.DB.Structure.FabricLapSplicePosition

Fabric lap splice position in the fabric distribution

## Syntax (C#)
```csharp
public enum FabricLapSplicePosition
```